app/controllers/home_controller.rb

INSERT INTO "users" ("email") VALUES ($1) RETURNING "id"  [["email", "zreitano@gmail.com"]]
---
  def add_email
    user = User.create(email: params[:email])